## Video 3.4 - Data Aggregation over a Data Frame

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('store_data.csv')

data['TOTAL'] = data['QUANTITY'] * data['UNIT PRICE']

data.head()

         DATE CUSTOMER    ITEM  QUANTITY  UNIT PRICE  TOTAL
0  2017-01-02    Alice    Milk       1.0         1.0    1.0
1  2017-01-02    Alice  Orange       5.0         2.0   10.0
2  2017-01-03      Bob  Banana       3.0         3.0    9.0
3  2017-01-03      Bob  Orange       3.0         2.0    6.0
4  2017-01-03    Alice   Apple       3.0         5.0   15.0

#### Group By (Aggregation)

In [3]:
data.groupby('CUSTOMER')

In [4]:
data.groupby('CUSTOMER').sum()

          QUANTITY  UNIT PRICE   TOTAL
CUSTOMER
Alice         15.0        18.0    36.0
Bob            9.0        12.0    22.0
Charlie        4.0      1003.0  2006.0

In [6]:
data[['TOTAL', 'QUANTITY']].groupby(data['CUSTOMER']).sum()

           TOTAL  QUANTITY
CUSTOMER
Alice       36.0      15.0
Bob         22.0       9.0
Charlie   2006.0       4.0

In [8]:
data.groupby('CUSTOMER')['TOTAL', 'QUANTITY'].sum()

           TOTAL  QUANTITY
CUSTOMER
Alice       36.0      15.0
Bob         22.0       9.0
Charlie   2006.0       4.0

#### Example

Best-selling items (highest quantity and total revenue)

In [9]:
data.groupby(data['ITEM'])[['QUANTITY', 'TOTAL']].sum().sort_values(by='QUANTITY', ascending=False)

              QUANTITY   TOTAL
ITEM
Orange            12.0    20.0
Banana             9.0    27.0
Apple              3.0    15.0
Gold nuggets       2.0  2000.0
Milk               2.0     2.0

#### Example

Returning customers

In [10]:
data['DATE'].groupby(data['CUSTOMER']).count()  # wrong count

CUSTOMER
Alice      8
Bob        5
Charlie    2
Name: DATE, dtype: int64

In [11]:
data.head()

         DATE CUSTOMER    ITEM  QUANTITY  UNIT PRICE  TOTAL
0  2017-01-02    Alice    Milk       1.0         1.0    1.0
1  2017-01-02    Alice  Orange       5.0         2.0   10.0
2  2017-01-03      Bob  Banana       3.0         3.0    9.0
3  2017-01-03      Bob  Orange       3.0         2.0    6.0
4  2017-01-03    Alice   Apple       3.0         5.0   15.0

In [12]:
data['DATE'].groupby([data['CUSTOMER'], data['DATE']]).count()

CUSTOMER  DATE
Alice     2017-01-02    2
          2017-01-03    2
          2017-01-04    2
          2017-01-05    1
          2017-01-06    1
Bob       2017-01-03    2
          2017-01-04    1
          2017-01-05    1
          2017-01-06    1
Charlie   2017-01-04    1
          2017-01-05    1
Name: DATE, dtype: int64

In [13]:
data['DATE'].groupby(data['CUSTOMER']).unique()

CUSTOMER
Alice      [2017-01-02, 2017-01-03, 2017-01-04, 2017-01-0...
Bob         [2017-01-03, 2017-01-04, 2017-01-05, 2017-01-06]
Charlie                             [2017-01-04, 2017-01-05]
Name: DATE, dtype: object

In [14]:
data['DATE'].groupby(data['CUSTOMER']).unique().apply(len)

CUSTOMER
Alice      5
Bob        4
Charlie    2
Name: DATE, dtype: int64